wrkProfiler/wrk/wrk-stage-5.txt
+++++++++++++++++++++++++++++++++++++PUT++++++++++++++++++++++++++++++++++++++

Port 8081 


wrk -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  2 threads and 4 connections
  Thread calibration: mean lat.: 0.979ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.915ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  640.14us  16.94ms   94.55%
    Req/Sec   529.09     87.09     1.33k    74.32%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.92ms
 75.000%    1.20ms
 90.000%    1.38ms
 99.000%    2.13ms
 99.900%    9.69ms
 99.990%   14.88ms
 99.999%   16.96ms
100.000%   16.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.202     0.000000            1         1.00
       0.435     0.100000         5038         1.11
       0.533     0.200000        10000         1.25
       0.657     0.300000        15007         1.43
       0.789     0.400000        20002         1.67
       0.915     0.500000        25017         2.00
       0.971     0.550000        27529         2.22
       1.029     0.600000        30011         2.50
       1.088     0.650000        32530         2.86
       1.143     0.700000        35020         3.33
       1.197     0.750000        37508         4.00
       1.223     0.775000        38752         4.44
       1.249     0.800000        40006         5.00
       1.276     0.825000        41261         5.71
       1.306     0.850000        42509         6.67
       1.338     0.875000        43759         8.00
       1.358     0.887500        44389         8.89
       1.379     0.900000        45004        10.00
       1.403     0.912500        45629        11.43
       1.434     0.925000        46244        13.33
       1.473     0.937500        46877        16.00
       1.496     0.943750        47185        17.78
       1.521     0.950000        47497        20.00
       1.550     0.956250        47803        22.86
       1.586     0.962500        48123        26.67
       1.631     0.968750        48427        32.00
       1.659     0.971875        48585        35.56
       1.694     0.975000        48740        40.00
       1.735     0.978125        48899        45.71
       1.793     0.981250        49053        53.33
       1.867     0.984375        49208        64.00
       1.924     0.985938        49289        71.11
       1.979     0.987500        49367        80.00
       2.046     0.989062        49444        91.43
       2.211     0.990625        49521       106.67
       2.679     0.992188        49599       128.00
       2.985     0.992969        49638       142.22
       3.375     0.993750        49677       160.00
       3.807     0.994531        49716       182.86
       4.531     0.995313        49755       213.33
       5.407     0.996094        49794       256.00
       5.971     0.996484        49814       284.44
       6.483     0.996875        49833       320.00
       6.863     0.997266        49853       365.71
       7.355     0.997656        49872       426.67
       8.047     0.998047        49892       512.00
       8.327     0.998242        49902       568.89
       8.687     0.998437        49911       640.00
       9.103     0.998633        49921       731.43
       9.399     0.998828        49931       853.33
       9.711     0.999023        49941      1024.00
       9.807     0.999121        49946      1137.78
      10.167     0.999219        49950      1280.00
      10.407     0.999316        49956      1462.86
      10.479     0.999414        49960      1706.67
      10.959     0.999512        49965      2048.00
      11.143     0.999561        49968      2275.56
      11.223     0.999609        49970      2560.00
      11.711     0.999658        49972      2925.71
      12.063     0.999707        49975      3413.33
      12.447     0.999756        49977      4096.00
      12.863     0.999780        49979      4551.11
      12.927     0.999805        49980      5120.00
      13.623     0.999829        49981      5851.43
      13.703     0.999854        49982      6826.67
      14.471     0.999878        49983      8192.00
      14.879     0.999890        49984      9102.22
      15.423     0.999902        49985     10240.00
      15.423     0.999915        49985     11702.86
      15.543     0.999927        49987     13653.33
      15.543     0.999939        49987     16384.00
      15.543     0.999945        49987     18204.44
      15.543     0.999951        49987     20480.00
      15.543     0.999957        49987     23405.71
      15.863     0.999963        49988     27306.67
      15.863     0.999969        49988     32768.00
      15.863     0.999973        49988     36408.89
      15.863     0.999976        49988     40960.00
      15.863     0.999979        49988     46811.43
      16.959     0.999982        49989     54613.33
      16.959     1.000000        49989          inf
#[Mean    =        0.951, StdDeviation   =        0.640]
#[Max     =       16.944, Total count    =        49989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60000 requests in 1.00m, 3.83MB read
Requests/sec:    999.97
Transfer/sec:     65.43KB


PORT 8083


wrk -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8083
Running 1m test @ http://localhost:8083
  2 threads and 4 connections
  Thread calibration: mean lat.: 1.735ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.640ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.15ms  578.62us  15.85ms   89.92%
    Req/Sec   397.99    146.50     1.10k    47.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.07ms
 75.000%    1.29ms
 90.000%    1.61ms
 99.000%    2.01ms
 99.900%    9.46ms
 99.990%   13.00ms
 99.999%   15.85ms
100.000%   15.85ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.198     0.000000            1         1.00
       0.791     0.100000         3763         1.11
       0.956     0.200000         7550         1.25
       1.003     0.300000        11269         1.43
       1.037     0.400000        15015         1.67
       1.073     0.500000        18751         2.00
       1.096     0.550000        20649         2.22
       1.122     0.600000        22520         2.50
       1.162     0.650000        24385         2.86
       1.218     0.700000        26256         3.33
       1.289     0.750000        28125         4.00
       1.330     0.775000        29081         4.44
       1.368     0.800000        30010         5.00
       1.414     0.825000        30948         5.71
       1.473     0.850000        31884         6.67
       1.544     0.875000        32817         8.00
       1.577     0.887500        33285         8.89
       1.605     0.900000        33755        10.00
       1.631     0.912500        34222        11.43
       1.657     0.925000        34688        13.33
       1.683     0.937500        35156        16.00
       1.697     0.943750        35399        17.78
       1.710     0.950000        35619        20.00
       1.724     0.956250        35854        22.86
       1.739     0.962500        36100        26.67
       1.758     0.968750        36327        32.00
       1.768     0.971875        36439        35.56
       1.782     0.975000        36559        40.00
       1.796     0.978125        36673        45.71
       1.816     0.981250        36791        53.33
       1.841     0.984375        36910        64.00
       1.860     0.985938        36967        71.11
       1.888     0.987500        37028        80.00
       1.930     0.989062        37083        91.43
       2.083     0.990625        37142       106.67
       2.345     0.992188        37201       128.00
       2.579     0.992969        37230       142.22
       2.973     0.993750        37259       160.00
       3.547     0.994531        37288       182.86
       3.953     0.995313        37318       213.33
       5.079     0.996094        37347       256.00
       5.523     0.996484        37362       284.44
       5.979     0.996875        37376       320.00
       6.731     0.997266        37391       365.71
       7.243     0.997656        37406       426.67
       7.739     0.998047        37420       512.00
       8.095     0.998242        37428       568.89
       8.519     0.998437        37435       640.00
       8.927     0.998633        37442       731.43
       9.327     0.998828        37450       853.33
       9.655     0.999023        37457      1024.00
       9.871     0.999121        37461      1137.78
       9.967     0.999219        37464      1280.00
      10.223     0.999316        37468      1462.86
      10.383     0.999414        37472      1706.67
      10.975     0.999512        37475      2048.00
      11.063     0.999561        37477      2275.56
      11.239     0.999609        37479      2560.00
      11.359     0.999658        37481      2925.71
      11.503     0.999707        37483      3413.33
      11.631     0.999756        37484      4096.00
      11.959     0.999780        37485      4551.11
      11.967     0.999805        37486      5120.00
      12.119     0.999829        37487      5851.43
      12.407     0.999854        37488      6826.67
      12.999     0.999878        37489      8192.00
      12.999     0.999890        37489      9102.22
      13.007     0.999902        37490     10240.00
      13.007     0.999915        37490     11702.86
      13.511     0.999927        37491     13653.33
      13.511     0.999939        37491     16384.00
      13.511     0.999945        37491     18204.44
      15.807     0.999951        37492     20480.00
      15.807     0.999957        37492     23405.71
      15.807     0.999963        37492     27306.67
      15.807     0.999969        37492     32768.00
      15.807     0.999973        37492     36408.89
      15.855     0.999976        37493     40960.00
      15.855     1.000000        37493          inf
#[Mean    =        1.153, StdDeviation   =        0.579]
#[Max     =       15.848, Total count    =        37493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  46181 requests in 1.00m, 2.95MB read
  Socket errors: connect 0, read 0, write 0, timeout 26
Requests/sec:    769.66
Transfer/sec:     50.36KB

PORT 8082

wrk -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  2 threads and 4 connections
  Thread calibration: mean lat.: 1.163ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms  648.65us  15.78ms   91.23%
    Req/Sec   531.37     65.61     1.22k    74.88%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.05ms
 75.000%    1.31ms
 90.000%    1.57ms
 99.000%    2.41ms
 99.900%    9.66ms
 99.990%   14.22ms
 99.999%   15.78ms
100.000%   15.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.186     0.000000            1         1.00
       0.516     0.100000         5020         1.11
       0.677     0.200000        10016         1.25
       0.823     0.300000        15032         1.43
       0.943     0.400000        20030         1.67
       1.047     0.500000        25017         2.00
       1.097     0.550000        27506         2.22
       1.150     0.600000        30024         2.50
       1.202     0.650000        32542         2.86
       1.252     0.700000        35027         3.33
       1.310     0.750000        37520         4.00
       1.346     0.775000        38762         4.44
       1.389     0.800000        40000         5.00
       1.436     0.825000        41263         5.71
       1.480     0.850000        42500         6.67
       1.523     0.875000        43745         8.00
       1.545     0.887500        44387         8.89
       1.567     0.900000        45009        10.00
       1.588     0.912500        45617        11.43
       1.615     0.925000        46256        13.33
       1.642     0.937500        46872        16.00
       1.658     0.943750        47197        17.78
       1.674     0.950000        47494        20.00
       1.693     0.956250        47803        22.86
       1.720     0.962500        48119        26.67
       1.748     0.968750        48427        32.00
       1.769     0.971875        48584        35.56
       1.791     0.975000        48743        40.00
       1.822     0.978125        48900        45.71
       1.873     0.981250        49054        53.33
       1.962     0.984375        49208        64.00
       2.073     0.985938        49288        71.11
       2.191     0.987500        49365        80.00
       2.331     0.989062        49444        91.43
       2.465     0.990625        49521       106.67
       2.801     0.992188        49599       128.00
       3.175     0.992969        49638       142.22
       3.509     0.993750        49677       160.00
       4.089     0.994531        49716       182.86
       4.839     0.995313        49755       213.33
       5.759     0.996094        49794       256.00
       6.119     0.996484        49814       284.44
       6.567     0.996875        49833       320.00
       6.991     0.997266        49853       365.71
       7.671     0.997656        49872       426.67
       8.287     0.998047        49892       512.00
       8.511     0.998242        49902       568.89
       8.831     0.998437        49911       640.00
       9.215     0.998633        49921       731.43
       9.383     0.998828        49931       853.33
       9.807     0.999023        49941      1024.00
       9.927     0.999121        49946      1137.78
      10.271     0.999219        49950      1280.00
      10.431     0.999316        49955      1462.86
      10.847     0.999414        49960      1706.67
      11.055     0.999512        49965      2048.00
      11.119     0.999561        49968      2275.56
      11.183     0.999609        49970      2560.00
      11.335     0.999658        49972      2925.71
      11.671     0.999707        49975      3413.33
      11.895     0.999756        49977      4096.00
      12.071     0.999780        49979      4551.11
      12.431     0.999805        49980      5120.00
      12.735     0.999829        49981      5851.43
      12.767     0.999854        49982      6826.67
      13.735     0.999878        49983      8192.00
      14.215     0.999890        49984      9102.22
      14.407     0.999902        49985     10240.00
      14.407     0.999915        49985     11702.86
      14.583     0.999927        49986     13653.33
      14.583     0.999939        49986     16384.00
      15.527     0.999945        49987     18204.44
      15.527     0.999951        49987     20480.00
      15.527     0.999957        49987     23405.71
      15.647     0.999963        49988     27306.67
      15.647     0.999969        49988     32768.00
      15.647     0.999973        49988     36408.89
      15.647     0.999976        49988     40960.00
      15.647     0.999979        49988     46811.43
      15.783     0.999982        49989     54613.33
      15.783     1.000000        49989          inf
#[Mean    =        1.082, StdDeviation   =        0.649]
#[Max     =       15.776, Total count    =        49989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60000 requests in 1.00m, 3.83MB read
Requests/sec:    999.98
Transfer/sec:     65.43KB



++++++++++++++++++++++++++++++++GET+++++++++++++++++++++++++++++++++++++++++++

PORT 8081

 wrk -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  2 threads and 4 connections
  Thread calibration: mean lat.: 1.702ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.455ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.94ms  570.94us  16.13ms   85.93%
    Req/Sec   409.32    150.69     1.11k    63.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  811.00us
 75.000%    1.12ms
 90.000%    1.45ms
 99.000%    2.36ms
 99.900%    8.49ms
 99.990%   13.15ms
 99.999%   16.14ms
100.000%   16.14ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.184     0.000000            1         1.00
       0.451     0.100000         3876         1.11
       0.681     0.200000         7749         1.25
       0.726     0.300000        11612         1.43
       0.762     0.400000        15520         1.67
       0.811     0.500000        19316         2.00
       0.847     0.550000        21267         2.22
       0.897     0.600000        23171         2.50
       0.965     0.650000        25104         2.86
       1.041     0.700000        27032         3.33
       1.115     0.750000        28955         4.00
       1.152     0.775000        29917         4.44
       1.190     0.800000        30904         5.00
       1.229     0.825000        31846         5.71
       1.272     0.850000        32814         6.67
       1.333     0.875000        33781         8.00
       1.380     0.887500        34257         8.89
       1.445     0.900000        34743        10.00
       1.522     0.912500        35220        11.43
       1.584     0.925000        35705        13.33
       1.644     0.937500        36192        16.00
       1.674     0.943750        36429        17.78
       1.711     0.950000        36669        20.00
       1.751     0.956250        36916        22.86
       1.802     0.962500        37150        26.67
       1.876     0.968750        37394        32.00
       1.913     0.971875        37515        35.56
       1.958     0.975000        37633        40.00
       2.007     0.978125        37754        45.71
       2.061     0.981250        37876        53.33
       2.141     0.984375        37996        64.00
       2.183     0.985938        38056        71.11
       2.239     0.987500        38116        80.00
       2.311     0.989062        38175        91.43
       2.393     0.990625        38237       106.67
       2.493     0.992188        38296       128.00
       2.575     0.992969        38326       142.22
       2.715     0.993750        38356       160.00
       2.957     0.994531        38386       182.86
       3.415     0.995313        38417       213.33
       3.765     0.996094        38447       256.00
       3.955     0.996484        38462       284.44
       4.371     0.996875        38477       320.00
       4.699     0.997266        38492       365.71
       4.967     0.997656        38507       426.67
       5.771     0.998047        38522       512.00
       6.231     0.998242        38530       568.89
       6.675     0.998437        38537       640.00
       7.279     0.998633        38545       731.43
       7.987     0.998828        38552       853.33
       8.719     0.999023        38560      1024.00
       8.959     0.999121        38564      1137.78
       9.199     0.999219        38567      1280.00
       9.551     0.999316        38571      1462.86
      10.439     0.999414        38575      1706.67
      11.071     0.999512        38580      2048.00
      11.439     0.999561        38581      2275.56
      11.447     0.999609        38582      2560.00
      11.591     0.999658        38584      2925.71
      11.831     0.999707        38586      3413.33
      11.927     0.999756        38588      4096.00
      12.279     0.999780        38589      4551.11
      12.479     0.999805        38590      5120.00
      12.679     0.999829        38591      5851.43
      13.095     0.999854        38592      6826.67
      13.151     0.999878        38593      8192.00
      13.151     0.999890        38593      9102.22
      13.719     0.999902        38594     10240.00
      13.719     0.999915        38594     11702.86
      14.775     0.999927        38595     13653.33
      14.775     0.999939        38595     16384.00
      14.775     0.999945        38595     18204.44
      14.807     0.999951        38596     20480.00
      14.807     0.999957        38596     23405.71
      14.807     0.999963        38596     27306.67
      14.807     0.999969        38596     32768.00
      14.807     0.999973        38596     36408.89
      16.135     0.999976        38597     40960.00
      16.135     1.000000        38597          inf
#[Mean    =        0.938, StdDeviation   =        0.571]
#[Max     =       16.128, Total count    =        38597]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  48608 requests in 1.00m, 3.34MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:    810.11
Transfer/sec:     57.07KB


PORT 8082

wrk -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  2 threads and 4 connections
  Thread calibration: mean lat.: 1.649ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.474ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.07ms  633.74us  21.79ms   88.80%
    Req/Sec   528.46     78.65     1.22k    67.87%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.03ms
 75.000%    1.32ms
 90.000%    1.59ms
 99.000%    2.44ms
 99.900%    9.45ms
 99.990%   15.02ms
 99.999%   21.81ms
100.000%   21.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.194     0.000000            1         1.00
       0.509     0.100000         5024         1.11
       0.660     0.200000        10008         1.25
       0.793     0.300000        15018         1.43
       0.912     0.400000        20046         1.67
       1.029     0.500000        25001         2.00
       1.086     0.550000        27513         2.22
       1.142     0.600000        30017         2.50
       1.201     0.650000        32515         2.86
       1.257     0.700000        35025         3.33
       1.321     0.750000        37499         4.00
       1.359     0.775000        38758         4.44
       1.402     0.800000        40006         5.00
       1.445     0.825000        41260         5.71
       1.492     0.850000        42501         6.67
       1.540     0.875000        43749         8.00
       1.563     0.887500        44375         8.89
       1.590     0.900000        45005        10.00
       1.615     0.912500        45638        11.43
       1.646     0.925000        46251        13.33
       1.681     0.937500        46870        16.00
       1.699     0.943750        47184        17.78
       1.723     0.950000        47497        20.00
       1.755     0.956250        47810        22.86
       1.792     0.962500        48115        26.67
       1.843     0.968750        48430        32.00
       1.875     0.971875        48584        35.56
       1.919     0.975000        48746        40.00
       1.977     0.978125        48898        45.71
       2.057     0.981250        49052        53.33
       2.145     0.984375        49209        64.00
       2.203     0.985938        49287        71.11
       2.275     0.987500        49366        80.00
       2.379     0.989062        49443        91.43
       2.487     0.990625        49521       106.67
       2.663     0.992188        49599       128.00
       2.831     0.992969        49638       142.22
       3.083     0.993750        49677       160.00
       3.397     0.994531        49717       182.86
       3.753     0.995313        49755       213.33
       4.351     0.996094        49795       256.00
       4.575     0.996484        49814       284.44
       4.835     0.996875        49833       320.00
       5.199     0.997266        49853       365.71
       5.819     0.997656        49872       426.67
       6.427     0.998047        49892       512.00
       6.979     0.998242        49902       568.89
       8.019     0.998437        49911       640.00
       8.239     0.998633        49921       731.43
       9.023     0.998828        49931       853.33
       9.623     0.999023        49941      1024.00
      10.023     0.999121        49946      1137.78
      10.431     0.999219        49950      1280.00
      10.983     0.999316        49955      1462.86
      11.743     0.999414        49960      1706.67
      12.247     0.999512        49965      2048.00
      12.559     0.999561        49968      2275.56
      12.743     0.999609        49970      2560.00
      12.847     0.999658        49972      2925.71
      13.087     0.999707        49975      3413.33
      13.303     0.999756        49977      4096.00
      13.783     0.999780        49979      4551.11
      13.831     0.999805        49980      5120.00
      13.943     0.999829        49981      5851.43
      13.967     0.999854        49982      6826.67
      14.087     0.999878        49983      8192.00
      15.015     0.999890        49984      9102.22
      15.735     0.999902        49985     10240.00
      15.735     0.999915        49985     11702.86
      16.063     0.999927        49986     13653.33
      16.063     0.999939        49986     16384.00
      19.279     0.999945        49987     18204.44
      19.279     0.999951        49987     20480.00
      19.279     0.999957        49987     23405.71
      19.311     0.999963        49988     27306.67
      19.311     0.999969        49988     32768.00
      19.311     0.999973        49988     36408.89
      19.311     0.999976        49988     40960.00
      19.311     0.999979        49988     46811.43
      21.807     0.999982        49989     54613.33
      21.807     1.000000        49989          inf
#[Mean    =        1.073, StdDeviation   =        0.634]
#[Max     =       21.792, Total count    =        49989]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59999 requests in 1.00m, 4.14MB read
  Non-2xx or 3xx responses: 1
Requests/sec:    999.98
Transfer/sec:     70.60KB

PORT 8083

wrk -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8083
Running 1m test @ http://localhost:8083
  2 threads and 4 connections
  Thread calibration: mean lat.: 1.694ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.702ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.17ms  684.87us  26.77ms   90.69%
    Req/Sec   528.21     82.63     1.30k    64.79%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.13ms
 75.000%    1.43ms
 90.000%    1.66ms
 99.000%    2.49ms
 99.900%   10.53ms
 99.990%   18.74ms
 99.999%   26.78ms
100.000%   26.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.202     0.000000            1         1.00
       0.584     0.100000         5025         1.11
       0.773     0.200000        10014         1.25
       0.905     0.300000        15037         1.43
       1.019     0.400000        20024         1.67
       1.129     0.500000        25018         2.00
       1.182     0.550000        27504         2.22
       1.236     0.600000        30023         2.50
       1.298     0.650000        32520         2.86
       1.365     0.700000        35001         3.33
       1.436     0.750000        37526         4.00
       1.471     0.775000        38763         4.44
       1.509     0.800000        40007         5.00
       1.543     0.825000        41267         5.71
       1.578     0.850000        42509         6.67
       1.615     0.875000        43748         8.00
       1.637     0.887500        44389         8.89
       1.659     0.900000        45001        10.00
       1.683     0.912500        45628        11.43
       1.711     0.925000        46261        13.33
       1.745     0.937500        46874        16.00
       1.764     0.943750        47186        17.78
       1.788     0.950000        47498        20.00
       1.818     0.956250        47809        22.86
       1.860     0.962500        48124        26.67
       1.924     0.968750        48431        32.00
       1.964     0.971875        48587        35.56
       2.006     0.975000        48745        40.00
       2.061     0.978125        48898        45.71
       2.141     0.981250        49054        53.33
       2.215     0.984375        49215        64.00
       2.259     0.985938        49291        71.11
       2.315     0.987500        49370        80.00
       2.407     0.989062        49445        91.43
       2.555     0.990625        49524       106.67
       2.737     0.992188        49602       128.00
       2.915     0.992969        49640       142.22
       3.123     0.993750        49679       160.00
       3.455     0.994531        49718       182.86
       3.863     0.995313        49757       213.33
       4.475     0.996094        49796       256.00
       4.851     0.996484        49816       284.44
       5.119     0.996875        49835       320.00
       5.503     0.997266        49855       365.71
       5.927     0.997656        49874       426.67
       7.231     0.998047        49894       512.00
       7.595     0.998242        49904       568.89
       8.343     0.998437        49913       640.00
       8.927     0.998633        49923       731.43
       9.583     0.998828        49933       853.33
      10.639     0.999023        49943      1024.00
      11.199     0.999121        49948      1137.78
      11.711     0.999219        49952      1280.00
      12.071     0.999316        49957      1462.86
      13.119     0.999414        49962      1706.67
      13.415     0.999512        49967      2048.00
      13.975     0.999561        49970      2275.56
      14.255     0.999609        49972      2560.00
      15.111     0.999658        49974      2925.71
      15.639     0.999707        49977      3413.33
      16.463     0.999756        49979      4096.00
      16.879     0.999780        49981      4551.11
      17.695     0.999805        49982      5120.00
      17.727     0.999829        49983      5851.43
      17.743     0.999854        49984      6826.67
      18.271     0.999878        49985      8192.00
      18.735     0.999890        49986      9102.22
      19.023     0.999902        49987     10240.00
      19.023     0.999915        49987     11702.86
      21.231     0.999927        49988     13653.33
      21.231     0.999939        49988     16384.00
      23.807     0.999945        49989     18204.44
      23.807     0.999951        49989     20480.00
      23.807     0.999957        49989     23405.71
      25.247     0.999963        49990     27306.67
      25.247     0.999969        49990     32768.00
      25.247     0.999973        49990     36408.89
      25.247     0.999976        49990     40960.00
      25.247     0.999979        49990     46811.43
      26.783     0.999982        49991     54613.33
      26.783     1.000000        49991          inf
#[Mean    =        1.170, StdDeviation   =        0.685]
#[Max     =       26.768, Total count    =        49991]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60000 requests in 1.00m, 4.14MB read
Requests/sec:    999.97
Transfer/sec:     70.60KB



++++++++++++++++++++++++++++++++++++PUT 2/1 GET+++++++++++++++++++++++++++++++

PORT 8081 (PUT)

wrk -t4 -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8081
Running 1m test @ http://localhost:8081
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.274ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.242ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.272ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.314ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  576.38us  15.99ms   90.24%
    Req/Sec   209.39    115.37   777.00     68.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.22ms
 90.000%    1.41ms
 99.000%    1.93ms
 99.900%    9.17ms
 99.990%   14.68ms
 99.999%   16.00ms
100.000%   16.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.212     0.000000            1         1.00
       0.485     0.100000         4010         1.11
       0.628     0.200000         8002         1.25
       0.742     0.300000        11959         1.43
       0.844     0.400000        15960         1.67
       0.956     0.500000        19947         2.00
       1.010     0.550000        21931         2.22
       1.064     0.600000        23925         2.50
       1.116     0.650000        25928         2.86
       1.168     0.700000        27938         3.33
       1.220     0.750000        29901         4.00
       1.246     0.775000        30903         4.44
       1.272     0.800000        31908         5.00
       1.299     0.825000        32895         5.71
       1.329     0.850000        33907         6.67
       1.362     0.875000        34893         8.00
       1.383     0.887500        35391         8.89
       1.406     0.900000        35891        10.00
       1.431     0.912500        36375        11.43
       1.467     0.925000        36873        13.33
       1.508     0.937500        37370        16.00
       1.531     0.943750        37624        17.78
       1.555     0.950000        37867        20.00
       1.584     0.956250        38124        22.86
       1.611     0.962500        38375        26.67
       1.646     0.968750        38616        32.00
       1.664     0.971875        38741        35.56
       1.687     0.975000        38866        40.00
       1.712     0.978125        38989        45.71
       1.745     0.981250        39113        53.33
       1.789     0.984375        39239        64.00
       1.814     0.985938        39300        71.11
       1.841     0.987500        39363        80.00
       1.889     0.989062        39425        91.43
       1.963     0.990625        39487       106.67
       2.089     0.992188        39549       128.00
       2.185     0.992969        39580       142.22
       2.339     0.993750        39611       160.00
       2.579     0.994531        39643       182.86
       3.127     0.995313        39674       213.33
       3.969     0.996094        39705       256.00
       4.415     0.996484        39720       284.44
       4.855     0.996875        39736       320.00
       5.323     0.997266        39752       365.71
       5.671     0.997656        39767       426.67
       6.463     0.998047        39783       512.00
       6.739     0.998242        39790       568.89
       6.983     0.998437        39798       640.00
       8.171     0.998633        39806       731.43
       8.823     0.998828        39814       853.33
       9.647     0.999023        39822      1024.00
       9.767     0.999121        39825      1137.78
      10.031     0.999219        39829      1280.00
      11.127     0.999316        39833      1462.86
      11.319     0.999414        39837      1706.67
      12.111     0.999512        39841      2048.00
      12.231     0.999561        39843      2275.56
      12.295     0.999609        39845      2560.00
      12.407     0.999658        39847      2925.71
      12.655     0.999707        39849      3413.33
      12.943     0.999756        39851      4096.00
      12.975     0.999780        39852      4551.11
      13.311     0.999805        39853      5120.00
      14.335     0.999829        39854      5851.43
      14.495     0.999854        39855      6826.67
      14.679     0.999878        39856      8192.00
      14.679     0.999890        39856      9102.22
      14.759     0.999902        39857     10240.00
      14.759     0.999915        39857     11702.86
      15.071     0.999927        39858     13653.33
      15.071     0.999939        39858     16384.00
      15.071     0.999945        39858     18204.44
      15.335     0.999951        39859     20480.00
      15.335     0.999957        39859     23405.71
      15.335     0.999963        39859     27306.67
      15.335     0.999969        39859     32768.00
      15.335     0.999973        39859     36408.89
      15.999     0.999976        39860     40960.00
      15.999     1.000000        39860          inf
#[Mean    =        0.986, StdDeviation   =        0.576]
#[Max     =       15.992, Total count    =        39860]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49869 requests in 1.00m, 3.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 20
Requests/sec:    831.09
Transfer/sec:     54.38KB

PORT 8082 (GET) 

wrk -t4 -c4 -d60s -R1000 -s ./wrk/get.lua --latency http://localhost:8082
Running 1m test @ http://localhost:8082
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.353ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.357ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.319ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.303ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms  515.87us  14.37ms   86.70%
    Req/Sec   262.61     48.58   600.00     74.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.96ms
 75.000%    1.21ms
 90.000%    1.39ms
 99.000%    2.00ms
 99.900%    7.30ms
 99.990%   12.61ms
 99.999%   14.38ms
100.000%   14.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.261     0.000000            2         1.00
       0.512     0.100000         5015         1.11
       0.633     0.200000        10021         1.25
       0.752     0.300000        15019         1.43
       0.861     0.400000        20014         1.67
       0.961     0.500000        25000         2.00
       1.012     0.550000        27526         2.22
       1.064     0.600000        30038         2.50
       1.114     0.650000        32510         2.86
       1.164     0.700000        35012         3.33
       1.213     0.750000        37498         4.00
       1.237     0.775000        38758         4.44
       1.261     0.800000        40017         5.00
       1.285     0.825000        41262         5.71
       1.311     0.850000        42538         6.67
       1.340     0.875000        43752         8.00
       1.362     0.887500        44371         8.89
       1.386     0.900000        45004        10.00
       1.417     0.912500        45635        11.43
       1.458     0.925000        46260        13.33
       1.507     0.937500        46876        16.00
       1.536     0.943750        47188        17.78
       1.567     0.950000        47496        20.00
       1.599     0.956250        47809        22.86
       1.632     0.962500        48124        26.67
       1.669     0.968750        48434        32.00
       1.692     0.971875        48592        35.56
       1.717     0.975000        48748        40.00
       1.747     0.978125        48904        45.71
       1.783     0.981250        49058        53.33
       1.836     0.984375        49215        64.00
       1.876     0.985938        49292        71.11
       1.919     0.987500        49371        80.00
       1.964     0.989062        49450        91.43
       2.039     0.990625        49527       106.67
       2.177     0.992188        49605       128.00
       2.313     0.992969        49644       142.22
       2.451     0.993750        49683       160.00
       2.709     0.994531        49722       182.86
       2.951     0.995313        49761       213.33
       3.401     0.996094        49800       256.00
       3.747     0.996484        49820       284.44
       4.191     0.996875        49839       320.00
       4.551     0.997266        49859       365.71
       5.231     0.997656        49878       426.67
       5.991     0.998047        49898       512.00
       6.203     0.998242        49908       568.89
       6.403     0.998437        49917       640.00
       6.623     0.998633        49927       731.43
       6.855     0.998828        49937       853.33
       7.383     0.999023        49947      1024.00
       7.615     0.999121        49952      1137.78
       8.023     0.999219        49956      1280.00
       8.319     0.999316        49961      1462.86
       9.271     0.999414        49966      1706.67
      10.023     0.999512        49971      2048.00
      10.615     0.999561        49974      2275.56
      10.759     0.999609        49976      2560.00
      10.887     0.999658        49978      2925.71
      11.151     0.999707        49981      3413.33
      11.543     0.999756        49983      4096.00
      11.607     0.999780        49985      4551.11
      11.775     0.999805        49986      5120.00
      11.983     0.999829        49987      5851.43
      12.247     0.999854        49988      6826.67
      12.455     0.999878        49989      8192.00
      12.615     0.999890        49990      9102.22
      13.303     0.999902        49991     10240.00
      13.303     0.999915        49991     11702.86
      13.991     0.999927        49992     13653.33
      13.991     0.999939        49992     16384.00
      14.103     0.999945        49993     18204.44
      14.103     0.999951        49993     20480.00
      14.103     0.999957        49993     23405.71
      14.327     0.999963        49994     27306.67
      14.327     0.999969        49994     32768.00
      14.327     0.999973        49994     36408.89
      14.327     0.999976        49994     40960.00
      14.327     0.999979        49994     46811.43
      14.375     0.999982        49995     54613.33
      14.375     1.000000        49995          inf
#[Mean    =        0.989, StdDeviation   =        0.516]
#[Max     =       14.368, Total count    =        49995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60004 requests in 1.00m, 4.10MB read
Requests/sec:   1000.04
Transfer/sec:     69.92KB

PORT 8083 (PUT)

wrk -t4 -c4 -d60s -R1000 -s ./wrk/put.lua --latency http://localhost:8083
Running 1m test @ http://localhost:8083
  4 threads and 4 connections
  Thread calibration: mean lat.: 1.299ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.329ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.301ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.296ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.96ms  541.53us  18.77ms   89.38%
    Req/Sec   264.08     51.61   666.00     66.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.19ms
 90.000%    1.36ms
 99.000%    1.97ms
 99.900%    7.89ms
 99.990%   14.24ms
 99.999%   18.78ms
100.000%   18.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.215     0.000000            1         1.00
       0.488     0.100000         5029         1.11
       0.612     0.200000        10036         1.25
       0.723     0.300000        15004         1.43
       0.835     0.400000        20003         1.67
       0.933     0.500000        25000         2.00
       0.980     0.550000        27541         2.22
       1.027     0.600000        29999         2.50
       1.083     0.650000        32516         2.86
       1.136     0.700000        35009         3.33
       1.189     0.750000        37499         4.00
       1.215     0.775000        38758         4.44
       1.242     0.800000        40020         5.00
       1.269     0.825000        41280         5.71
       1.295     0.850000        42511         6.67
       1.325     0.875000        43776         8.00
       1.343     0.887500        44387         8.89
       1.361     0.900000        45009        10.00
       1.384     0.912500        45627        11.43
       1.415     0.925000        46258        13.33
       1.455     0.937500        46880        16.00
       1.480     0.943750        47185        17.78
       1.520     0.950000        47505        20.00
       1.550     0.956250        47821        22.86
       1.578     0.962500        48121        26.67
       1.615     0.968750        48435        32.00
       1.634     0.971875        48593        35.56
       1.656     0.975000        48748        40.00
       1.687     0.978125        48906        45.71
       1.717     0.981250        49061        53.33
       1.762     0.984375        49215        64.00
       1.797     0.985938        49292        71.11
       1.848     0.987500        49373        80.00
       1.911     0.989062        49449        91.43
       2.025     0.990625        49526       106.67
       2.259     0.992188        49607       128.00
       2.441     0.992969        49644       142.22
       2.617     0.993750        49682       160.00
       2.851     0.994531        49722       182.86
       3.163     0.995313        49761       213.33
       3.715     0.996094        49799       256.00
       4.139     0.996484        49819       284.44
       4.791     0.996875        49838       320.00
       5.423     0.997266        49858       365.71
       5.987     0.997656        49877       426.67
       6.311     0.998047        49897       512.00
       6.455     0.998242        49907       568.89
       6.623     0.998437        49916       640.00
       6.727     0.998633        49926       731.43
       7.299     0.998828        49936       853.33
       8.255     0.999023        49946      1024.00
       8.719     0.999121        49951      1137.78
       8.943     0.999219        49955      1280.00
       9.343     0.999316        49960      1462.86
       9.727     0.999414        49965      1706.67
       9.991     0.999512        49970      2048.00
      10.255     0.999561        49973      2275.56
      10.487     0.999609        49975      2560.00
      11.175     0.999658        49977      2925.71
      11.871     0.999707        49980      3413.33
      11.967     0.999756        49982      4096.00
      12.167     0.999780        49984      4551.11
      12.175     0.999805        49985      5120.00
      12.375     0.999829        49986      5851.43
      12.471     0.999854        49987      6826.67
      12.503     0.999878        49988      8192.00
      14.239     0.999890        49989      9102.22
      14.807     0.999902        49991     10240.00
      14.807     0.999915        49991     11702.86
      14.807     0.999927        49991     13653.33
      14.807     0.999939        49991     16384.00
      15.439     0.999945        49992     18204.44
      15.439     0.999951        49992     20480.00
      15.439     0.999957        49992     23405.71
      15.599     0.999963        49993     27306.67
      15.599     0.999969        49993     32768.00
      15.599     0.999973        49993     36408.89
      15.599     0.999976        49993     40960.00
      15.599     0.999979        49993     46811.43
      18.783     0.999982        49994     54613.33
      18.783     1.000000        49994          inf
#[Mean    =        0.963, StdDeviation   =        0.542]
#[Max     =       18.768, Total count    =        49994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60003 requests in 1.00m, 3.83MB read
Requests/sec:   1000.02
Transfer/sec:     65.43KB